platformio/platform-titiva/misc/svd/TM4C1294NCPDT.svd
        <register>
          <name>RTCPD</name>
          <description>GPTM RTC Predivide</description>
          <addressOffset>0x00000058</addressOffset>
          <fields>
            <field>
              <name>TIMER_RTCPD_RTCPD</name>
              <description>RTC Predivide Counter Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAPS</name>
          <description>GPTM Timer A Prescale Snapshot</description>
          <addressOffset>0x0000005C</addressOffset>
          <fields>
            <field>
              <name>TIMER_TAPS_PSS</name>
              <description>GPTM Timer A Prescaler Snapshot</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPS</name>
          <description>GPTM Timer B Prescale Snapshot</description>
          <addressOffset>0x00000060</addressOffset>
          <fields>
            <field>
              <name>TIMER_TBPS_PSS</name>
              <description>GPTM Timer A Prescaler Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAEV</name>
          <description>GPTM DMA Event</description>
          <addressOffset>0x0000006C</addressOffset>
          <fields>
            <field>
              <name>TIMER_DMAEV_TATODMAEN</name>
              <description>GPTM A Time-Out Event DMA Trigger Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIMER_DMAEV_CAMDMAEN</name>
              <description>GPTM A Capture Match Event DMA Trigger Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIMER_DMAEV_CAEDMAEN</name>
              <description>GPTM A Capture Event DMA Trigger Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIMER_DMAEV_RTCDMAEN</name>
              <description>GPTM A RTC Match Event DMA Trigger Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TIMER_DMAEV_TAMDMAEN</name>
              <description>GPTM A Mode Match Event DMA Trigger Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIMER_DMAEV_TBTODMAEN</name>
              <description>GPTM B Time-Out Event DMA Trigger Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIMER_DMAEV_CBMDMAEN</name>
              <description>GPTM B Capture Match Event DMA Trigger Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TIMER_DMAEV_CBEDMAEN</name>
              <description>GPTM B Capture Event DMA Trigger Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TIMER_DMAEV_TBMDMAEN</name>
              <description>GPTM B Mode Match Event DMA Trigger Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCEV</name>
          <description>GPTM ADC Event</description>
          <addressOffset>0x00000070</addressOffset>
          <fields>
            <field>
              <name>TIMER_ADCEV_TATOADCEN</name>
              <description>GPTM A Time-Out Event ADC Trigger Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIMER_ADCEV_CAMADCEN</name>
              <description>GPTM A Capture Match Event ADC Trigger Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIMER_ADCEV_CAEADCEN</name>
              <description>GPTM A Capture Event ADC Trigger Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIMER_ADCEV_RTCADCEN</name>
              <description>GPTM RTC Match Event ADC Trigger Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TIMER_ADCEV_TAMADCEN</name>
              <description>GPTM A Mode Match Event ADC Trigger Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIMER_ADCEV_TBTOADCEN</name>
              <description>GPTM B Time-Out Event ADC Trigger Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIMER_ADCEV_CBMADCEN</name>
              <description>GPTM B Capture Match Event ADC Trigger Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TIMER_ADCEV_CBEADCEN</name>
              <description>GPTM B Capture Event ADC Trigger Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TIMER_ADCEV_TBMADCEN</name>
              <description>GPTM B Mode Match Event ADC Trigger Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>GPTM Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>TIMER_PP_SIZE</name>
              <description>Count Size</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIMER_PP_SIZE_16</name>
                  <description>Timer A and Timer B counters are 16 bits each with an 8-bit prescale counter</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER_PP_SIZE_32</name>
                  <description>Timer A and Timer B counters are 32 bits each with a 16-bit prescale counter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMER_PP_CHAIN</name>
              <description>Chain with Other Timers</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIMER_PP_SYNCCNT</name>
              <description>Synchronize Start</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIMER_PP_ALTCLK</name>
              <description>Alternate Clock Source</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CC</name>
          <description>GPTM Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <fields>
            <field>
              <name>TIMER_CC_ALTCLK</name>
              <description>Alternate Clock Source</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
