platformio/platform-titiva/misc/svd/TM4C1294NCPDT.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCTL</name>
      <description>Register map for SYSCTL peripheral</description>
      <groupName>SYSCTL</groupName>
      <prependToName>SYSCTL</prependToName>
      <baseAddress>0x400FE000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>SYSCTL</name><value>28</value></interrupt>
      <registers>
        <register>
          <name>DID0</name>
          <description>Device Identification 0</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DID0_MIN</name>
              <description>Minor Revision</description>
              <bitRange>[7:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MIN_0</name>
                  <description>Initial device, or a major revision update</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MIN_1</name>
                  <description>First metal layer change</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MIN_2</name>
                  <description>Second metal layer change</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID0_MAJ</name>
              <description>Major Revision</description>
              <bitRange>[15:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MAJ_REVA</name>
                  <description>Revision A (initial device)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MAJ_REVB</name>
                  <description>Revision B (first base layer revision)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID0_MAJ_REVC</name>
                  <description>Revision C (second base layer revision)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID0_CLASS</name>
              <description>Device Class</description>
              <bitRange>[23:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID0_CLASS_TM4C129</name>
                  <description>Tiva(TM) TM4C129-class microcontrollers</description>
                  <value>0xa</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID0_VER</name>
              <description>DID0 Version</description>
              <bitRange>[30:28]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID0_VER_1</name>
                  <description>Second version of the DID0 register format.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DID1</name>
          <description>Device Identification 1</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_DID1_QUAL</name>
              <description>Qualification Status</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_QUAL_ES</name>
                  <description>Engineering Sample (unqualified)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_QUAL_PP</name>
                  <description>Pilot Production (unqualified)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_QUAL_FQ</name>
                  <description>Fully Qualified</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID1_ROHS</name>
              <description>RoHS-Compliance</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DID1_PKG</name>
              <description>Package Type</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PKG_QFP</name>
                  <description>QFP package</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PKG_BGA</name>
                  <description>BGA package</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID1_TEMP</name>
              <description>Temperature Range</description>
              <bitRange>[7:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_TEMP_C</name>
                  <description>Commercial temperature range</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_TEMP_I</name>
                  <description>Industrial temperature range</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_TEMP_E</name>
                  <description>Extended temperature range</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID1_PINCNT</name>
              <description>Package Pin Count</description>
              <bitRange>[15:13]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PINCNT_100</name>
                  <description>100-pin LQFP package</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PINCNT_64</name>
                  <description>64-pin LQFP package</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PINCNT_144</name>
                  <description>144-pin LQFP package</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PINCNT_157</name>
                  <description>157-pin BGA package</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_DID1_PINCNT_128</name>
                  <description>128-pin TQFP package</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_DID1_PRTNO</name>
              <description>Part Number</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DID1_FAM</name>
              <description>Family</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>SYSCTL_DID1_VER</name>
              <description>DID1 Version</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PTBOCTL</name>
          <description>Power-Temp Brown Out Control</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PTBOCTL_VDD_UBOR</name>
              <description>VDD (VDDS) under BOR Event Action</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_PTBOCTL_VDD_UBOR_NONE</name>
                  <description>No Action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PTBOCTL_VDD_UBOR_SYSINT</name>
                  <description>System control interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PTBOCTL_VDD_UBOR_NMI</name>
                  <description>NMI</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PTBOCTL_VDD_UBOR_RST</name>
                  <description>Reset</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_PTBOCTL_VDDA_UBOR</name>
              <description>VDDA under BOR Event Action</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_PTBOCTL_VDDA_UBOR_NONE</name>
                  <description>No Action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PTBOCTL_VDDA_UBOR_SYSINT</name>
                  <description>System control interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PTBOCTL_VDDA_UBOR_NMI</name>
                  <description>NMI</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_PTBOCTL_VDDA_UBOR_RST</name>
                  <description>Reset</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>Raw Interrupt Status</description>
          <addressOffset>0x00000050</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RIS_BORRIS</name>
              <description>Brown-Out Reset Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RIS_MOFRIS</name>
              <description>Main Oscillator Failure Raw Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RIS_PLLLRIS</name>
              <description>PLL Lock Raw Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RIS_MOSCPUPRIS</name>
              <description>MOSC Power Up Raw Interrupt Status</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IMC</name>
          <description>Interrupt Mask Control</description>
          <addressOffset>0x00000054</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_IMC_BORIM</name>
              <description>Brown-Out Reset Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_IMC_MOFIM</name>
              <description>Main Oscillator Failure Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_IMC_PLLLIM</name>
              <description>PLL Lock Interrupt Mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_IMC_MOSCPUPIM</name>
              <description>MOSC Power Up Interrupt Mask</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <description>Masked Interrupt Status and Clear</description>
          <addressOffset>0x00000058</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_MISC_BORMIS</name>
              <description>BOR Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MISC_MOFMIS</name>
              <description>Main Oscillator Failure Masked Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MISC_PLLLMIS</name>
              <description>PLL Lock Masked Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MISC_MOSCPUPMIS</name>
              <description>MOSC Power Up Masked Interrupt Status</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RESC</name>
          <description>Reset Cause</description>
          <addressOffset>0x0000005C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RESC_EXT</name>
              <description>External Reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_POR</name>
              <description>Power-On Reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_BOR</name>
              <description>Brown-Out Reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_WDT0</name>
              <description>Watchdog Timer 0 Reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_SW</name>
              <description>Software Reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_WDT1</name>
              <description>Watchdog Timer 1 Reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_HIB</name>
              <description>HIB Reset</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_HSSR</name>
              <description>HSSR Reset</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RESC_MOSCFAIL</name>
              <description>MOSC Failure Reset</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRTC</name>
          <description>Power-Temperature Cause</description>
          <addressOffset>0x00000060</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PWRTC_VDD_UBOR</name>
              <description>VDD Under BOR Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PWRTC_VDDA_UBOR</name>
              <description>VDDA Under BOR Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NMIC</name>
          <description>NMI Cause Register</description>
          <addressOffset>0x00000064</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_NMIC_EXTERNAL</name>
              <description>External Pin NMI</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_NMIC_POWER</name>
              <description>Power/Brown Out Event NMI</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_NMIC_WDT0</name>
              <description>Watch Dog Timer (WDT) 0 NMI</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_NMIC_WDT1</name>
              <description>Watch Dog Timer (WDT) 1 NMI</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_NMIC_TAMPER</name>
              <description>Tamper Event NMI</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_NMIC_MOSCFAIL</name>
              <description>MOSC Failure NMI</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MOSCCTL</name>
          <description>Main Oscillator Control</description>
          <addressOffset>0x0000007C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_MOSCCTL_CVAL</name>
              <description>Clock Validation for MOSC</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MOSCCTL_MOSCIM</name>
              <description>MOSC Failure Action</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MOSCCTL_NOXTAL</name>
              <description>No Crystal Connected</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MOSCCTL_PWRDN</name>
              <description>Power Down</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_MOSCCTL_OSCRNG</name>
              <description>Oscillator Range</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RSCLKCFG</name>
          <description>Run and Sleep Mode Configuration Register</description>
          <addressOffset>0x000000B0</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_RSCLKCFG_PSYSDIV</name>
              <description>PLL System Clock Divisor</description>
              <bitRange>[9:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RSCLKCFG_OSYSDIV</name>
              <description>Oscillator System Clock Divisor</description>
              <bitRange>[19:10]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RSCLKCFG_OSCSRC</name>
              <description>Oscillator Source</description>
              <bitRange>[23:20]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RSCLKCFG_OSCSRC_PIOSC</name>
                  <description>PIOSC is oscillator source</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RSCLKCFG_OSCSRC_LFIOSC</name>
                  <description>LFIOSC is oscillator source</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RSCLKCFG_OSCSRC_MOSC</name>
                  <description>MOSC is oscillator source</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RSCLKCFG_OSCSRC_RTC</name>
                  <description>Hibernation Module RTC Oscillator (RTCOSC)</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RSCLKCFG_PLLSRC</name>
              <description>PLL Source</description>
              <bitRange>[27:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYSCTL_RSCLKCFG_PLLSRC_PIOSC</name>
                  <description>PIOSC is PLL input clock source</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCTL_RSCLKCFG_PLLSRC_MOSC</name>
                  <description>MOSC is the PLL input clock source</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSCTL_RSCLKCFG_USEPLL</name>
              <description>Use PLL</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RSCLKCFG_ACG</name>
              <description>Auto Clock Gating</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RSCLKCFG_NEWFREQ</name>
              <description>New PLLFREQ Accept</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>SYSCTL_RSCLKCFG_MEMTIMU</name>
              <description>Memory Timing Register Update</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
