platformio/platform-titiva/misc/svd/TM4C1294NCPDT.svd
        <register>
          <name>PCUART</name>
          <description>Universal Asynchronous Receiver/Transmitter Power Control</description>
          <addressOffset>0x00000918</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCUART_P0</name>
              <description>UART Module 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P1</name>
              <description>UART Module 1 Power Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P2</name>
              <description>UART Module 2 Power Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P3</name>
              <description>UART Module 3 Power Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P4</name>
              <description>UART Module 4 Power Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P5</name>
              <description>UART Module 5 Power Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P6</name>
              <description>UART Module 6 Power Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCUART_P7</name>
              <description>UART Module 7 Power Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCSSI</name>
          <description>Synchronous Serial Interface Power Control</description>
          <addressOffset>0x0000091C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCSSI_P0</name>
              <description>SSI Module 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCSSI_P1</name>
              <description>SSI Module 1 Power Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCSSI_P2</name>
              <description>SSI Module 2 Power Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCSSI_P3</name>
              <description>SSI Module 3 Power Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCI2C</name>
          <description>Inter-Integrated Circuit Power Control</description>
          <addressOffset>0x00000920</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCI2C_P0</name>
              <description>I2C Module 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P1</name>
              <description>I2C Module 1 Power Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P2</name>
              <description>I2C Module 2 Power Control</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P3</name>
              <description>I2C Module 3 Power Control</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P4</name>
              <description>I2C Module 4 Power Control</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P5</name>
              <description>I2C Module 5 Power Control</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P6</name>
              <description>I2C Module 6 Power Control</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P7</name>
              <description>I2C Module 7 Power Control</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P8</name>
              <description>I2C Module 8 Power Control</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCI2C_P9</name>
              <description>I2C Module 9 Power Control</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCUSB</name>
          <description>Universal Serial Bus Power Control</description>
          <addressOffset>0x00000928</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCUSB_P0</name>
              <description>USB Module Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCEPHY</name>
          <description>Ethernet PHY Power Control</description>
          <addressOffset>0x00000930</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCEPHY_P0</name>
              <description>Ethernet PHY Module Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCCAN</name>
          <description>Controller Area Network Power Control</description>
          <addressOffset>0x00000934</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCCAN_P0</name>
              <description>CAN Module 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCCAN_P1</name>
              <description>CAN Module 1 Power Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCADC</name>
          <description>Analog-to-Digital Converter Power Control</description>
          <addressOffset>0x00000938</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCADC_P0</name>
              <description>ADC Module 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PCADC_P1</name>
              <description>ADC Module 1 Power Control</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCACMP</name>
          <description>Analog Comparator Power Control</description>
          <addressOffset>0x0000093C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCACMP_P0</name>
              <description>Analog Comparator Module 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCPWM</name>
          <description>Pulse Width Modulator Power Control</description>
          <addressOffset>0x00000940</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCPWM_P0</name>
              <description>PWM Module 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCQEI</name>
          <description>Quadrature Encoder Interface Power Control</description>
          <addressOffset>0x00000944</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCQEI_P0</name>
              <description>QEI Module 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCEEPROM</name>
          <description>EEPROM Power Control</description>
          <addressOffset>0x00000958</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCEEPROM_P0</name>
              <description>EEPROM Module 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCCCM</name>
          <description>CRC and Cryptographic Modules Power Control</description>
          <addressOffset>0x00000974</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCCCM_P0</name>
              <description>CRC and Cryptographic Modules Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCEMAC</name>
          <description>Ethernet MAC Power Control</description>
          <addressOffset>0x0000099C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PCEMAC_P0</name>
              <description>Ethernet MAC Module 0 Power Control</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRWD</name>
          <description>Watchdog Timer Peripheral Ready</description>
          <addressOffset>0x00000A00</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRWD_R0</name>
              <description>Watchdog Timer 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRWD_R1</name>
              <description>Watchdog Timer 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRTIMER</name>
          <description>16/32-Bit General-Purpose Timer Peripheral Ready</description>
          <addressOffset>0x00000A04</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRTIMER_R0</name>
              <description>16/32-Bit General-Purpose Timer 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRTIMER_R1</name>
              <description>16/32-Bit General-Purpose Timer 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRTIMER_R2</name>
              <description>16/32-Bit General-Purpose Timer 2 Peripheral Ready</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRTIMER_R3</name>
              <description>16/32-Bit General-Purpose Timer 3 Peripheral Ready</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRTIMER_R4</name>
              <description>16/32-Bit General-Purpose Timer 4 Peripheral Ready</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRTIMER_R5</name>
              <description>16/32-Bit General-Purpose Timer 5 Peripheral Ready</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRTIMER_R6</name>
              <description>16/32-Bit General-Purpose Timer 6 Peripheral Ready</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRTIMER_R7</name>
              <description>16/32-Bit General-Purpose Timer 7 Peripheral Ready</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRGPIO</name>
          <description>General-Purpose Input/Output Peripheral Ready</description>
          <addressOffset>0x00000A08</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRGPIO_R0</name>
              <description>GPIO Port A Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R1</name>
              <description>GPIO Port B Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R2</name>
              <description>GPIO Port C Peripheral Ready</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R3</name>
              <description>GPIO Port D Peripheral Ready</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R4</name>
              <description>GPIO Port E Peripheral Ready</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R5</name>
              <description>GPIO Port F Peripheral Ready</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R6</name>
              <description>GPIO Port G Peripheral Ready</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R7</name>
              <description>GPIO Port H Peripheral Ready</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R8</name>
              <description>GPIO Port J Peripheral Ready</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R9</name>
              <description>GPIO Port K Peripheral Ready</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R10</name>
              <description>GPIO Port L Peripheral Ready</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R11</name>
              <description>GPIO Port M Peripheral Ready</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R12</name>
              <description>GPIO Port N Peripheral Ready</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R13</name>
              <description>GPIO Port P Peripheral Ready</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRGPIO_R14</name>
              <description>GPIO Port Q Peripheral Ready</description>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRDMA</name>
          <description>Micro Direct Memory Access Peripheral Ready</description>
          <addressOffset>0x00000A0C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRDMA_R0</name>
              <description>uDMA Module Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PREPI</name>
          <description>EPI Peripheral Ready</description>
          <addressOffset>0x00000A10</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PREPI_R0</name>
              <description>EPI Module Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRHIB</name>
          <description>Hibernation Peripheral Ready</description>
          <addressOffset>0x00000A14</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRHIB_R0</name>
              <description>Hibernation Module Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRUART</name>
          <description>Universal Asynchronous Receiver/Transmitter Peripheral Ready</description>
          <addressOffset>0x00000A18</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRUART_R0</name>
              <description>UART Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R1</name>
              <description>UART Module 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R2</name>
              <description>UART Module 2 Peripheral Ready</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R3</name>
              <description>UART Module 3 Peripheral Ready</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R4</name>
              <description>UART Module 4 Peripheral Ready</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R5</name>
              <description>UART Module 5 Peripheral Ready</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R6</name>
              <description>UART Module 6 Peripheral Ready</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRUART_R7</name>
              <description>UART Module 7 Peripheral Ready</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSSI</name>
          <description>Synchronous Serial Interface Peripheral Ready</description>
          <addressOffset>0x00000A1C</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRSSI_R0</name>
              <description>SSI Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRSSI_R1</name>
              <description>SSI Module 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRSSI_R2</name>
              <description>SSI Module 2 Peripheral Ready</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRSSI_R3</name>
              <description>SSI Module 3 Peripheral Ready</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI2C</name>
          <description>Inter-Integrated Circuit Peripheral Ready</description>
          <addressOffset>0x00000A20</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRI2C_R0</name>
              <description>I2C Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R1</name>
              <description>I2C Module 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R2</name>
              <description>I2C Module 2 Peripheral Ready</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R3</name>
              <description>I2C Module 3 Peripheral Ready</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R4</name>
              <description>I2C Module 4 Peripheral Ready</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R5</name>
              <description>I2C Module 5 Peripheral Ready</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R6</name>
              <description>I2C Module 6 Peripheral Ready</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R7</name>
              <description>I2C Module 7 Peripheral Ready</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R8</name>
              <description>I2C Module 8 Peripheral Ready</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRI2C_R9</name>
              <description>I2C Module 9 Peripheral Ready</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRUSB</name>
          <description>Universal Serial Bus Peripheral Ready</description>
          <addressOffset>0x00000A28</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRUSB_R0</name>
              <description>USB Module Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PREPHY</name>
          <description>Ethernet PHY Peripheral Ready</description>
          <addressOffset>0x00000A30</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PREPHY_R0</name>
              <description>Ethernet PHY Module Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRCAN</name>
          <description>Controller Area Network Peripheral Ready</description>
          <addressOffset>0x00000A34</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRCAN_R0</name>
              <description>CAN Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRCAN_R1</name>
              <description>CAN Module 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRADC</name>
          <description>Analog-to-Digital Converter Peripheral Ready</description>
          <addressOffset>0x00000A38</addressOffset>
          <fields>
            <field>
              <name>SYSCTL_PRADC_R0</name>
              <description>ADC Module 0 Peripheral Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSCTL_PRADC_R1</name>
              <description>ADC Module 1 Peripheral Ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
